{"article": {"title": "Managing Disk Space in Linux with the df Command", "id": 1394841, "description": "Linux commands", "published": false, "body_markdown": "---\n\n### **_Introduction_**\n\nThe `df` command is a useful tool for managing disk space on your Linux system. It displays information about the file system disk space usage, including the amount of free space, used space, and the percentage of space used. Here are some examples of using `df` command:\n\n### **_Show disk space usage in human-readable format_**\n\n```bash\ndf -h\n```\n\n### **_Show disk space usage for a specific file system_**\n\n```bash\ndh -hT /dev/sda1\n```\n\n### **_Show disk space usage for all file systems (including speudo file systems)_**\n\n```bash\ndf -aTh\n```\n\n### **_Show disk space usage for a specific file system and exclude file systems of a certain type_**\n\n```bash\ndf -hT -x tmpfs /dev/sda1\n```\n\n### **_Show disk space usage in bytes for all file systems (including empty file systems)_**\n\n```bash\ndf -BT\n```\n\n### **_Show disk space usage for a specific file system with inode information_**\n\n```bash\ndf -i /dev/sda1\n```\n\n### **_Show disk space usage with a specific output format_**\n\n```bash\ndf --output=source,fstype,size,used,avail,pcent,target\n```\n\n### **_Show disk space usage sorted by a specific column (ascending)_**\n\n```bash\ndf -hT | sort -k 3\n```\n\n### **_Show disk space usage sorted by a specific column (descending)_**\n\n```bash\ndf -hT | sort -k 3 -r\n```\n\n### **_Show disk space usage for all file systems and exclude the header line_**\n\n```bash\ndf -hT | tail -n +2\n```\n\n### **_Tips_**\n\n- Use the `h` option to display disk space usage in human-readable format (e.g., GB, MB)\n- Use the `x` option to exclude file systems of a certain type (e.g., tmpfs,devtmpfs)\n- Use the `-output` option to customize the output format of the command\n- Use the `sort` and `tail` commands to sort and filter the output as needed.\n\n### **_Conclusion_**\n\nIn summary, the `df` command is a powerful tool for managing disk space on your Linux system. With the various options available, you can easily view and analyze disk space usage for specific file systems and customize the output format.\nRemember to use the available sorting and filtering commands to further manage and analyze the output.\n\n**_Thank you for reading_** 🧑‍💻\n\n**_Stay tuned for more_** 🚀\n\n✌️ and **_logout_**\n\n<a href=\"https://www.buymeacoffee.com/k1lgor\" target=\"_blank\">\n<img src=\"https://cdn.buymeacoffee.com/buttons/v2/default-yellow.png\" alt=\"Buy Me A Coffee\" style=\"height: 60px !important;width: 217px !important;\" >\n</a>", "tags": ["bash", " linux", " beginners"], "series": "Linux from A to Z", "canonical_url": null, "cover_image": null}}